In [2]:
import pandas as pd
import numpy as np

In [ ]:
## data frame is a combination of rows and columns. there must be at least one row and one column.
## data series is same as data frame except that a single row or single column is taken.

In [5]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [6]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [7]:
df.to_csv('Test.csv')

In [ ]:
#accessing the elements
#two ways 1- .loc:location 2- .iloc :Index location

In [8]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [9]:
type(df.loc['Row1'])

pandas.core.series.Series

In [10]:
df.iloc[0:2,0:3] #type:dataframe

      column1  column2  column3
Row1        0        1        2
Row2        4        5        6

In [11]:
type(df.iloc[0:2])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:2,0] ##type: dataseries

Row1    0
Row2    4
Name: column1, dtype: int32

In [14]:
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [16]:
#convert dataframes into array

df.iloc[:,1:].values.shape

(5, 3)

In [17]:
#how to check the null condition?
#it needs to be checked in any data frame
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [18]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [19]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [21]:
type(df['column2']) ##another way of accessing the elemnts

pandas.core.series.Series

In [23]:
##to access two or more columns

df[['column2','column4']]

      column2  column4
Row1        1        3
Row2        5        7
Row3        9       11
Row4       13       15
Row5       17       19

In [24]:
## reading files,which are in csv format or any other 

df=pd.read_csv('Test.csv') #in csv, another parameter is also passed to change the separator in csv file , by defalult it is',' but we can change it to any other separator. we just need to pass the parameter here.

In [25]:
df.head()

  Unnamed: 0  column1  column2  column3  column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [26]:
df.info() ## gives information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   column1     5 non-null      int64
 2   column2     5 non-null      int64
 3   column3     5 non-null      int64
 4   column4     5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 328.0+ bytes

In [27]:
df.describe() #describe like mean.

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [28]:
# get the unique category count

df['column1'].value_counts

<bound method IndexOpsMixin.value_counts of 0     0
1     4
2     8
3    12
4    16
Name: column1, dtype: int64>

In [29]:
df[df['column2']>5]

  Unnamed: 0  column1  column2  column3  column4
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [30]:
##CSV

from io import StringIO,BytesIO

In [31]:
data=('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
      'c,d,3')

In [32]:
type(data)

str

In [33]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [34]:
##read from specific columns

df=pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [35]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [36]:
df.to_csv('Test1') #converts to csv file

In [37]:
data=('a,b,c\n'
      '1,2,3\n'
      '4,5,6\n'
      '7,8,9\n'
      '10,11,12')

In [53]:
df=pd.read_csv(StringIO(data),dtype=float)

In [54]:
df

      1     2     3
0   4.0   5.0   6.0
1   7.0   8.0   9.0
2  10.0  11.0  12.0

In [52]:
df['1']

0     4
1     7
2    10
Name: 1, dtype: object

In [57]:
df=pd.read_csv(StringIO(data),dtype={'2':int ,'3':float ,'1':'Int64'})

In [58]:
df

    1   2     3
0   4   5   6.0
1   7   8   9.0
2  10  11  12.0

In [68]:
## index columns and training delimiters

data=('a,b,c\n'
      '4,apple,bat\n'
      '8,orange,cow')

In [66]:
pd.read_csv(StringIO(data)) #by default indexing is 0,1 we can change it using following function

        a    b     c
4   apple  bat   5.7
8  orange  cow  10.0

In [64]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [69]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [71]:
#combining usecols and indexcols

pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [72]:
data= 'a,b\n"hello,pal,nice to see you",5'

In [73]:
pd.read_csv(StringIO(data),escapechar='\\')

                           a  b
0  hello,pal,nice to see you  5